/*
 * globals.h
 * הגדרות גלובליות ומשותפות לכל הפרויקט
 * 
 * קובץ זה מכיל הגדרות שכלל חלקי האסמבלר משתמשים בהן
 * כולל טיפוסים בסיסיים וקבועים מוגדרים (גדלים מקסימליים)
 * 
 * כלל הקבצים בפרויקט צריכים לכלול קובץ זה ע"מ שיוכלו לגשת להגדרות המשותפות
 */

#ifndef GLOBALS_H
#define GLOBALS_H

#include <stdio.h>
#include <stdlib.h>
  
/*
 * נגדיר טיפוס בוליאני
 *true/false לא מכירה את המילים השמורות c גרסה זו של שפת    
 *:מגדירים טיפוס בוליאני משלנו כך ש
 * 1 מוגדר TRUE
 * 0 מוגדר FALSE
 */
typedef enum {
    FALSE = 0,
    TRUE = 1
} bool;

/*
 * קבועים גלובליים של הפרויקט
 * 
 * MAX_LINE_LENGTH - אורך מקסימלי של שורה בקובץ האסמבלי
 * לפי הוראות הפרויקט שורה יכולה להכיל עד 80 תווים פלוס תו סוף שורה
 * 
 * MAX_LABEL_LENGTH - אורך מקסימלי של שם תווית
 * * לפי הוראות הפרויקט תווית יכולה להכיל עד 31 תווים 
 * 
 * MEMORY_SIZE - גודל הזיכרון הכולל שיש לאסמבלר
 * הזיכרון מכיל 4096 מילים שזהו הגודל המקסימלי של תוכנית
 * 
 * INITIAL_IC - כתובת ההתחלה של הקוד בזיכרון
 * * לפי הוראות הפרויקט כל תוכנית מתחילה מכתובת 100 
 * 
 * INITIAL_DC - כתובת ההתחלה של הנתונים
 * הנתונים מתחילים מ-0 במעבר הראשון ומוזזים אחר כך
 */
#define MAX_LINE_LENGTH 81
#define MAX_LABEL_LENGTH 31
#define MEMORY_SIZE 4096
#define INITIAL_IC 100
#define INITIAL_DC 0

#endif
