/*
 * second_pass.h
 * המעבר השני של האסמבלר
 * 
 * המעבר השני הוא השלב האחרון בתהליך האסמבלי
 * בשלב זה ממלאים את הכתובות האמיתיות של הסמלים
 * 
 * במעבר הראשון בנינו את טבלת הסמלים אך נשארו חורים בקוד
 * כעת במעבר השני אנו ממלאים את כל החורים האלה
 *  ובונים רשימת הפניות חיצוניותentry מטפלים בהוראות  
 */

#ifndef SECOND_PASS_H
#define SECOND_PASS_H

#include "structures.h"
#include "globals.h"

/*
 * פונ' אשר מריצה את המעבר השני על קובץ אסמבלי
 * 
 * הפונקציה עוברת על הקובץ אחרי פריסת המקרואים
 * ממלאת את כתובות הסמלים בקוד מכונה
 * 
 * הפונקציה משתמשת בטבלת הסמלים שנבנתה במעבר הראשון
 * והיא מעדכנת את מבנה הזיכרון עם כל הכתובות הסופיות
 * 
 * פרמטרים:
 *   filename - אחרי פריסת המקרואיםam-שם קובץ ה 
 *   symbols - מצביע לטבלת הסמלים שנבנתה במעבר הראשון
 *   memory - מצביע למבנה הזיכרון שיש בו את הקוד והנתונים
 *   externals - מצביע לרשימה ריקה שתמולא בהפניות חיצוניות
 * 
 * מחזירה: TRUE אם הצליח ליצור את הקובץ 
 *          FALSE אם נכשל*/
 
bool execute_second_pass(const char *filename, SymbolTable *symbols, MemoryImage *memory, ExternalList *externals);

#endif
